#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
import pandas as pd

data = pd.Series([4,8,15,16,23,41])
print(type(data))
data

<class 'pandas.core.series.Series'>

0     4
1     8
2    15
3    16
4    23
5    41
dtype: int64

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [45]:
## creating list of 10 elements
l = list(range(1,11))
pd.Series(l)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

#### Q3. Create a Pandas DataFrame that contains the following data
Name:[Alice Bob Claire]

Age: [25 30 27]

Gender:[Female Male Female]

In [49]:
## creating seires
Name = pd.Series(["Alice","Bob","Claire"])
Age = pd.Series([25,30,27])
Gender = pd.Series(["Female","Male","Female"])

# creating dict
d = {
    "Name" : Name,
    "Age" : Age,
    "Gender": Gender
}

#creating dataframe from the dictionary having key as column name and value as seiries
df = pd.DataFrame(d)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [54]:
# second method
x = {"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]}
df1 = pd.DataFrame(x)
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional labeled data structure that consists of rows and columns, where each column can have a different data type. It can be thought of as a table, similar to a spreadsheet or SQL table. Each column in a DataFrame is a pandas Series.

A pandas Series, on the other hand, is a one-dimensional labeled data structure that can contain any data type (e.g., integers, floats, strings, etc.). It can be thought of as a single column in a DataFrame.

In [39]:
## DATAFRAME is 2D structure with rows and coulmns

print(type(dataframe))
dataframe

<class 'pandas.core.frame.DataFrame'>

      name  age location
0  Prakash   21  Kolkata
1    Singh   18    Patna
2    Kumar   26     Agra
3    Gupta   24    Delhi

In [43]:
## SERIES is 1D strucutre (single column)
series = pd.Series(["Prakash","Singh",1,2,4])
print(type(series))
series

<class 'pandas.core.series.Series'>

0    Prakash
1      Singh
2          1
3          2
4          4
dtype: object

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

There are many functions available in Pandas that can be used to manipulate data in a DataFrame. Here are some common functions along with an example of when you might use them:

- head() and tail() : used to get the records from the first and last respecively.
- dtypes : used to get the data types of the columns.
- columns : used to get all the columns in a dataframe.
- describe() : used to get the five number summary of the data in the dataframe,etc.

In [35]:
print("HEAD FUNCTION:")
print(dataframe.head(1))

print("\n \nTAIL FUNCTION:")
print(dataframe.tail(1))

print("\n \nCOLUMNS FUNCTION:")
print(list(dataframe.columns))

print("\n\n DTYPES FUNCTION:")
print(list(dataframe.dtypes))

HEAD FUNCTION:
      name  age location
0  Prakash   21  Kolkata


TAIL FUNCTION:
    name  age location
3  Gupta   24    Delhi


COLUMNS FUNCTION:
['name', 'age', 'location']


 DTYPES FUNCTION:
[dtype('O'), dtype('int64'), dtype('O')]

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Both Series and DataFrame are mutable in nature, meaning their values can be modified after they are created. However, Panel is deprecated in the latest version of pandas and is no longer recommended for use.

#### 7. Create a DataFrame using multiple Series. Explain with an example

In [24]:
## creating series
name = pd.Series(["Prakash","Singh","Kumar","Gupta"])
age = pd.Series([21,18,26,24])
location = pd.Series(["Kolkata","Patna","Agra","Delhi"])

## dictionary with key as column names and values as series
data = {"name":name,
       "age":age,
       "location":location}

# creating dataframe
dataframe = pd.DataFrame(data)
dataframe

name        object
age          int64
location    object
dtype: object